# [起始索引:结束索引:步长],【起始索引:结束索引）左闭右开
# 当开始索引大于结束索引的时候，步长必须是负数，否则结果就是空列表
list1 = [10, 20, 30, 40, 50, 60, 70, 80, 90, 100]
list2 = list1[0:5:1]
print(list1)
print(list2)  # [10, 20, 30, 40, 50]

# [::],默认都不填就是从开始到结束，默认步长1
list3 = list1[::]
print(list3)  # [10, 20, 30, 40, 50, 60, 70, 80, 90, 100]

list4 = list1[:999:]
list5 = list1[3::]

print(list4)
print(list5)  # [40, 50, 60, 70, 80, 90, 100]

# 反向取数据
list6 = list1[7:2:-1]  # [80, 70, 60, 50, 40]
list7 = list1[7:2:1]  # []
print(list6)

# 一个特殊情况：当同时省略开始索引和结束索引时，如果步长时负数，那么Python就会自动对调：开始索引和结束索引
list8 = list1[::-1]  # [100, 90, 80, 70, 60, 50, 40, 30, 20, 10]
print(list8)

print('*' * 30)
# 对元组进行切片
tuple1 = (10, 20, 30, 40, 50, 60, 70, 80, 90, 100)
tuple2 = tuple1[0:5:1] #(10, 20, 30, 40, 50)
print(tuple1)
print(tuple2)

# 对字符串进行切片
msg1='welcome to python'
print(msg1)
msg2=msg1[2:9:2] #loet
print(msg2)


# 序列的其他操作-相加
# 只有同类型的才可以
















