# 增
# add方法：向集合中添加元素
# s1={10,20,30,40,5}
# s1.add(60)
# print(s1)

# update方法：向集合中添加元素（必须传递可迭代对象，例如：列表，元素，集合）
# s1={10,20,30,40,5}
# s1.update([60,70,80,90])
# s1.update((100,200))
# s1.update(range(300,307))
# print(s1) # {5, 70, 200, 10, 80, 20, 90, 30, 100, 40, 300, 301, 302, 303, 304, 305, 306, 60}

# 删除
# remove元素：从集合中移除指定元素，若元素不存在会报错，返回值无
# s1={10,20,30,40,50}
# s1.remove(20)
# print(s1)
# # discard元素：从集合中移除指定元素，若集合不存在不会报错，返回值无
# s1={10,20,30,40,50}
# s1.discard(20)
# print(s1)
# # pop():从集合中移除一个任意元素，有返回值，返回值是被移除的元素，随机的
# s1={10,20,30,40,50}
# popEle = s1.pop()
# print(popEle) #50
# # clear：清空集合，返回值无
# s1.clear()
# print(s1) # set(),结果是空集合

# 集合没有下标，不支持replace，所以集合没有专门用来改的方法，可以用remove+add组合来达到修改的效果
# s1={10,20,30,40,50}
# s1.remove(20)
# s1.add(66)
# print(s1) #{50, 66, 40, 10, 30}


# 查：由于集合没有下标，也不支持切片操作，所以集合不具备按位置访问的能力
# 成员运算符可以判断：某个元素是否在集合中

# s1={10,20,30,40,50}
# result=20 in s1
# print(result) #True

s1={10,20,30,40,50}
result=20 not in s1
print(result) #False













