# 定义有内容的字典
# d1={'张三':72,'李四':66,'王五':88}
# print(type(d1),d1) #<class 'dict'> {'张三': 72, '李四': 66, '王五': 88}


# 字典中的key不能重复，若是重复，则后写的会覆盖之前写的
# d1={'张三':72,'李四':66,'王五':88,'张三':99}
# print(d1) #{'张三': 99, '李四': 66, '王五': 88}

# 定义空字典
# d1={}
# d2=dict()
# print(d1,d2) #{} {}

#  字典中的key必须是不可变类型，但value可以是任意类型
# 通俗理解，不可变的东西才可以作为key

# d1={'张三':72,'李四':66,'王五':88}
# d2={('喝酒','抽烟'):72,'李四':66,'王五':88} # 元组可以作为key，不可变，列表不可以


# 字典是可回忆嵌套的
student_dict = {2025001: {'姓名': '张三', '年龄': 18, '成绩': 72}}
print(student_dict)
