# 查询
# d1 = {'张三':72,'李四':66,'王五':85}

# 直接取值，若key不存在就会报错
# result= d1['张三']
# print(result)

# 安全取值，若key不存在，会返回默认值，若没有设置默认值则返回None
# result= d1.get('奥特曼','抱歉，key不存在')
# print(result)


# 新增
# d1 = {'张三':72,'李四':66,'王五':85}
# d1['赵六']=100
# print(d1) #{'张三': 72, '李四': 66, '王五': 85, '赵六': 100}


# 修改的写法和新增是一样的，字典中存在对应的key就是修改，否则就是新增
# d1 = {'张三':72,'李四':66,'王五':85}
# # d1['张三']=100
# # 批量修改
# d1.update({'李四':69,'王五':80})
# print(d1)

# 删除操作
d1 = {'张三':72,'李四':66,'王五':85}
# 删除指定key的键值对，无返回值
# del d1['张三']
# print(d1) #{'李四': 66, '王五': 85}
# 删除指定key的键值对，有返回值
# result= d1.pop('张三')
# print(result)
# pop方法可以设置默认值，当要删除的key不存在的情况下，程序不会报错，并且可以返回这个默认值
# result= d1.pop('奥特曼','删除失败')
# print(result) #删除失败
result= d1.pop('张三','删除失败')
print(d1,result) #{'李四': 66, '王五': 85} 72